### Standardization

In [1]:
import numpy as np;
import pandas as pd;
import matplotlib as plt;

In [2]:
df = pd.read_csv("CSV_Files\Social_Network_Ads.csv");

In [3]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [4]:
df = df.iloc[:, 2:]

In [5]:
df

     Age  EstimatedSalary  Purchased
0     19            19000          0
1     35            20000          0
2     26            43000          0
3     27            57000          0
4     19            76000          0
..   ...              ...        ...
395   46            41000          1
396   51            23000          1
397   50            20000          1
398   36            33000          0
399   49            36000          1

[400 rows x 3 columns]

In [6]:
df.sample(5)

     Age  EstimatedSalary  Purchased
222   37           144000          1
51    18            44000          0
236   40            57000          0
368   38            71000          0
102   32            86000          0

In [7]:
df.describe()

              Age  EstimatedSalary   Purchased
count  400.000000       400.000000  400.000000
mean    37.655000     69742.500000    0.357500
std     10.482877     34096.960282    0.479864
min     18.000000     15000.000000    0.000000
25%     29.750000     43000.000000    0.000000
50%     37.000000     70000.000000    0.000000
75%     46.000000     88000.000000    1.000000
max     60.000000    150000.000000    1.000000

### Train Test Split

In [8]:
from sklearn.model_selection import train_test_split;

In [9]:
X_train,X_test,y_train, y_test = train_test_split(df.drop('Purchased', axis=1), df['Purchased'], test_size=0.3, random_state=0);

In [10]:
X_train

     Age  EstimatedSalary
92    26            15000
223   60           102000
234   38           112000
232   40           107000
377   42            53000
..   ...              ...
323   48            30000
192   29            43000
117   36            52000
47    27            54000
172   26           118000

[280 rows x 2 columns]

In [11]:
X_test

     Age  EstimatedSalary
132   30            87000
309   38            50000
341   35            75000
196   30            79000
246   35            50000
..   ...              ...
216   49            65000
259   45           131000
49    31            89000
238   46            82000
343   47            51000

[120 rows x 2 columns]

In [12]:
y_train

92     0
223    1
234    0
232    1
377    0
      ..
323    1
192    0
117    0
47     0
172    0
Name: Purchased, Length: 280, dtype: int64

In [13]:
y_test

132    0
309    0
341    0
196    0
246    0
      ..
216    0
259    1
49     0
238    0
343    1
Name: Purchased, Length: 120, dtype: int64

In [14]:
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((280, 2), (120, 2), (280,), (120,))

In [15]:
X_train.describe()

              Age  EstimatedSalary
count  280.000000       280.000000
mean    37.864286     69807.142857
std     10.218201     34641.201654
min     18.000000     15000.000000
25%     30.000000     43000.000000
50%     37.000000     70500.000000
75%     46.000000     88000.000000
max     60.000000    150000.000000

In [16]:
X_test.describe()

              Age  EstimatedSalary
count  120.000000       120.000000
mean    37.166667     69591.666667
std     11.104797     32933.724084
min     18.000000     15000.000000
25%     28.000000     47000.000000
50%     36.000000     64500.000000
75%     45.250000     87000.000000
max     60.000000    150000.000000

In [17]:
y_train.describe()

count    280.000000
mean       0.364286
std        0.482091
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        1.000000
Name: Purchased, dtype: float64

In [18]:
y_test.describe()

count    120.000000
mean       0.341667
std        0.476257
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        1.000000
Name: Purchased, dtype: float64

### StandardScaler
- StandardScaler object in sklearn perform the following operation on each element of features.
- X = X-(mean of the feature(column))/ Standard diviation
- In Standardization mean of the feature become 0 and standard diviation become 1 for all feature.

In [19]:
from sklearn.preprocessing import StandardScaler

In [20]:
# Create a StandardScaler Object
scaler = StandardScaler();

# fit the scaler to the train set, it will learn parameter such as mean, std, etc.
scaler.fit(X_train);

# Transform train and test sets
X_train_scaled = scaler.transform(X_train);
X_test_scaled = scaler.transform(X_test);

In [21]:
# Applying scale to data from give us numpy as we must convert it into data from again if we need.
X_train_scaled = pd.DataFrame(X_train_scaled, columns=X_train.columns);
X_test_scaled = pd.DataFrame(X_test_scaled, columns=X_test.columns);

In [22]:
X_train_scaled.sample(4)

          Age  EstimatedSalary
200 -0.476894        -1.122266
46   0.111345        -0.804156
217  0.209385        -0.370370
246 -0.967093        -0.948751

In [23]:
X_test_scaled.sample(4)

          Age  EstimatedSalary
83  -1.163172        -1.006589
44   0.503504         1.220177
66  -1.359252         0.555039
117 -0.672973         0.555039

In [24]:
# Applying the formula of StandardScale to an item of data frame manually (First item of age feature which is 26)

(X_train.iloc[0,0] - X_train.mean(axis=0)[0]) / X_train.std(axis=0)[0]

# Here you can see the return value after applying formula to the first item of age feature in X_train (not scaled yet) 
# dataframe is same as the first value of age in X_train_scaled (scaled) dataframe.

-1.1610934448305064

In [25]:
# Chicking what happen to mean and std after scaling

X_train_scaled.describe()

                Age  EstimatedSalary
count  2.800000e+02     2.800000e+02
mean   3.489272e-17     6.344132e-17
std    1.001791e+00     1.001791e+00
min   -1.947491e+00    -1.584970e+00
25%   -7.710131e-01    -7.752370e-01
50%   -8.473441e-02     2.003677e-02
75%    7.976239e-01     5.261201e-01
max    2.170181e+00     2.319101e+00

In [26]:
X_test_scaled.describe()

              Age  EstimatedSalary
count  120.000000       120.000000
mean    -0.068394        -0.006231
std      1.088712         0.952412
min     -1.947491        -1.584970
25%     -0.967093        -0.659561
50%     -0.182774        -0.153478
75%      0.724094         0.497201
max      2.170181         2.319101

### Effict of Scaling